
## Plan Result (sandbox)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.test-secret
* Update
  * module.plum-redis-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.test-secret will be created
  + resource "azurerm_key_vault_secret" "test-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox"
      + name                    = "test-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox"
        name                          = "crumble-recipe-backend-session-storage-sandbox"
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "2024-05-16"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ rdb_storage_connection_string           = (sensitive value)
            # (16 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":937,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->